{"_id":{"$oid":"60397cae244e788f0d74b712"},"Title":"Silence of the Lambs","Description":"A young FBI cadet must receive the help of an incarcerated and maniplulative cannibal killer to help catch another serial killer.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Jonathan Demme","Bio":"Robert Jonanthan Demme was an American director, producer, and screenwriter.","Birth":"1944","Death":"2017"},"ImagePath":"silenceofthelambs.png","Featured":true}
{"_id":{"$oid":"603d8325244e788f0d74b718"},"Title":"25th Hour","Description":"Cornered by the DEA, convicted New York drug dealer Montgomery Brogan reevaluates his life in the 24 remaining hours before facing a seven-year jail term.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between. Each of the types of subject-matter themes have various kinds of dramatic plots. Dramatic films are probably the largest film genre because they include a broad spectrum of films."},"Director":{"Name":"Spike Lee","Bio":"Shelton Jackson, 'Spike Lee' is an American film director, producer, screenwriter, actor, and professor. His production company, 40 Acres and a Mule Filmworks, has produced more than 35 films since 1983. He made his directorial debut with She's Gotta Have It (1986). He has since written and directed such films as Do the Right Thing (1989), Mo' Better Blues (1990), Jungle Fever (1991), Malcolm X (1992), Crooklyn (1994), Clockers (1995), 25th Hour (2002), Inside Man (2006), Chi-Raq (2015), BlacKkKlansman (2018) and Da 5 Bloods (2020). Lee also acted in ten of his films.","Birth":"1957-03-20"},"ImagePath":"25thhour.png","Featured":true}
{"_id":{"$oid":"603d85dc244e788f0d74b719"},"Title":"Best in Show","Description":"A 'behind the scenes' look into the highly competitive and cut-throat world of dog-shows through the eyes of a group of ruthless dog owners.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Christopher Guest","Bio":"Christopher Guest is an American–British screenwriter, composer, musician, director, actor, and comedian. Guest is most widely known in Hollywood for having written, directed, and starred in his series of comedy films shot in mock-documentary (mockumentary) style. Many scenes and character backgrounds in Guest's films are written and directed, although actors have no rehearsal time and the ensemble improvise scenes while filming them. The series of films began with This Is Spinal Tap (which he did not direct) and continued with Waiting for Guffman, Best in Show, A Mighty Wind, For Your Consideration, and Mascots.","Birth":"1948-02-05"},"ImagePath":"bestinshow.png","Featured":true}
{"_id":{"$oid":"603d86e4244e788f0d74b71a"},"Title":"The Royal Tenenbaums","Description":"The eccentric members of a dysfunctional family reluctantly gather under the same roof for various reasons.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Wes Anderson","Bio":"Wes Anderson is an American filmmaker. His films are known for their symmetry, eccentricity and distinctive visual and narrative styles, and he is regarded by some critics as a modern-day example of the auteur. Three of his films – The Royal Tenenbaums, Moonrise Kingdom, and The Grand Budapest Hotel – appeared in BBC Culture's 2016 poll of the greatest films since 2000.","Birth":"1969-05-01"},"ImagePath":"theroyaltenenbaums.png","Featured":true}
{"_id":{"$oid":"603d880a244e788f0d74b71b"},"Title":"Coming to America","Description":"An extremely pampered African Prince travels to Queens, New York, and goes undercover to find a wife that he can respect for her intelligence and will.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"John Landis","Bio":"John Landis is an American film director, screenwriter, producer, and actor. He is best known for the comedy films that he has directed, such as The Kentucky Fried Movie (1977), National Lampoon's Animal House (1978), The Blues Brothers (1980), An American Werewolf in London (1981), Trading Places (1983), Three Amigos (1986), Coming to America (1988) and Beverly Hills Cop III (1994), and for directing Michael Jackson's music videos for 'Thriller' (1983) and 'Black or White' (1991).","Birth":"1950-08-031"},"ImagePath":"comingtoamerica.png","Featured":true}
{"_id":{"$oid":"603d8903244e788f0d74b71c"},"Title":"Vacation","Description":"Rusty Griswold takes his own family on a road trip to 'Walley World' in order to spice things up with his wife and reconnect with his sons.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Jonathan Goldstein","Bio":"Jonathan Goldstein is an American screenwriter, television writer/producer, and film director. He has written for numerous situation comedies, including The PJ's starring Eddie Murphy, The Geena Davis Show, Good Morning Miami, Four Kings, and The New Adventures of Old Christine.","Birth":"1968-09-02"},"ImagePath":"vacation.png","Featured":true}
{"_id":{"$oid":"603d8b23244e788f0d74b71d"},"Title":"Black Panther","Description":"T'Challa, heir to the hidden but advanced kingdom of Wakanda, must step forward to lead his people into a new future and must confront a challenger from his country's past.","Genre":{"Name":"Science Fiction","Description":"Science Fiction or (SCI-FI) is a film genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, alien worlds, extrasensory perception and time travel, along with futuristic elements such as spacecraft, robots, cyborgs, interstellar travel or other technologies"},"Director":{"Name":"Ryan Coogler","Bio":"Ryan Coogler is an American film director, producer, and screenwriter. His first feature film, Fruitvale Station (2013), won the top audience and grand jury awards in the U.S. dramatic competition at the 2013 Sundance Film Festival. He has since co-written and directed the seventh film in the Rocky series, Creed (2015), and the Marvel film Black Panther (2018), the latter of which broke numerous box office records and became the highest-grossing film of all time by an African American director.","Birth":"1986-05-23"},"ImagePath":"blackpanther.png","Featured":true}
{"_id":{"$oid":"603d8c5b244e788f0d74b71e"},"Title":"The Avengers","Description":"Earth's mightiest heroes must come together and learn to fight as a team if they are going to stop the mischievous Loki and his alien army from enslaving humanity.","Genre":{"Name":"Adventure","Description":"Adventure films are a genre of film whose plots feature elements of travel. They typically involve protagonists who must leave their home or place of comfort and go to far away lands to fulfill a goal. Settings play an important role in adventure films, sometimes as big as the characters themselves."},"Director":{"Name":"Joss Whedon","Bio":"Joss Whedon is an American film director, producer, writer, and composer. He is the founder of Mutant Enemy Productions, he co-founded Bellwether Pictures, and is best known as the creator of several television series. These include Buffy the Vampire Slayer (1997–2003), Angel (1999–2004), Firefly (2002), Dollhouse (2009–2010), and Agents of S.H.I.E.L.D. (2013–2020). He also produces, directs, and has written several films.","Birth":"1964-06-23"},"ImagePath":"theavengers.png","Featured":true}
{"_id":{"$oid":"603d8d57244e788f0d74b71f"},"Title":"Rogue One: A Star Wars Story","Description":"The daughter of an Imperial scientist joins the Rebel Alliance in a risky move to steal the plans for the Death Star.","Genre":{"Name":"Science Fiction","Description":"Science Fiction or (SCI-FI) is a film genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, alien worlds, extrasensory perception and time travel, along with futuristic elements such as spacecraft, robots, cyborgs, interstellar travel or other technologies"},"Director":{"Name":"Gareth Edwards","Bio":"Gareth Edwards is a Welsh film director, film producer, screenwriter, cinematographer, production designer, and visual effects artist. He first gained widespread recognition for Monsters (2010), an independent film in which he served as writer, director, cinematographer, and visual effects artist. He subsequently directed the 2014 reboot of Godzilla, and the film Rogue One: A Star Wars Story (2016), the first in the Star Wars Anthology.","Birth":"1975-07-13"},"ImagePath":"rogueone.png","Featured":true}
{"_id":{"$oid":"603d8e5c244e788f0d74b720"},"Title":"Pan's Labyrinth","Description":"The story takes place in Spain during the summer of 1944, five years after the Spanish Civil War, during the early Francoist period. The narrative intertwines this real world with a mythical world centered on an overgrown, abandoned labyrinth and a mysterious faun creature, with whom the main character, Ofelia, interacts. Ofelia's stepfather, the Falangist Captain Vidal, hunts the Spanish Maquis who fight against the Francoist regime in the region, while Ofelia's pregnant mother Carmen grows increasingly ill. Ofelia meets several strange and magical creatures who become central to her story, leading her through the trials of the old labyrinth garden.","Genre":{"Name":"Fantasy","Description":"Fantasy films are films with fantastic themes, usually magic, supernatural events, mythology, folklore, or exotic fantasy worlds."},"Director":{"Name":"Guillermo del Toro","Bio":"Guillermo del Toro is a Mexican filmmaker, author, actor, and former special effects makeup artist. He is best known for the Academy Award-winning fantasy films Pan's Labyrinth (2006) and The Shape of Water (2017), winning the Oscars for Best Director and Best Picture for the latter.","Birth":"1964-10-09"},"ImagePath":"panslabyrinth.png","Featured":true}
{"_id":{"$oid":"603d8f20244e788f0d74b721"},"Title":"Waiting for Guffman","Description":"Waiting for Guffman is a 1996 American mockumentary comedy film written by Christopher Guest and Eugene Levy, and directed by Guest. The film's ensemble cast includes Guest, Levy, Catherine O'Hara, Fred Willard, and Parker Posey.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Christopher Guest","Bio":"Christopher Guest is an American–British screenwriter, composer, musician, director, actor, and comedian. Guest is most widely known in Hollywood for having written, directed, and starred in his series of comedy films shot in mock-documentary (mockumentary) style. Many scenes and character backgrounds in Guest's films are written and directed, although actors have no rehearsal time and the ensemble improvise scenes while filming them. The series of films began with This Is Spinal Tap (which he did not direct) and continued with Waiting for Guffman, Best in Show, A Mighty Wind, For Your Consideration, and Mascots.","Birth":"1948-02-05"},"ImagePath":"waitingforguffman.png","Featured":true}
